In [6]:
import pandas as pd
import numpy as np

In [10]:
list = [1,2,3,4,5]
# print(range(1,6))
df1 = pd.DataFrame(list)
print(df1)
print(type(df1))
df2 = df1.rename(columns={0:'열'})
print(df2)

   0
0  1
1  2
2  3
3  4
4  5
<class 'pandas.core.frame.DataFrame'>
   열
0  1
1  2
2  3
3  4
4  5

In [34]:
score = [
    ['정약용', 70, 80, 100],
    ['이순신', 75, 60, 90],
    ['이율곡', 50, 95, 56]
]
print(score)
df3 = pd.DataFrame(score)
print(type(df3))
df3

[['정약용', 70, 80, 100], ['이순신', 75, 60, 90], ['이율곡', 50, 95, 56]]
<class 'pandas.core.frame.DataFrame'>

     0   1   2    3
0  정약용  70  80  100
1  이순신  75  60   90
2  이율곡  50  95   56

In [33]:
df3.columns = ["이름", "국어", "영어", "수학"]
# print(df3)
# print(df3.shape)
# print(df3.index)
df3.info()
df3.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      object
 3   수학      3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

              국어          수학
count   3.000000    3.000000
mean   65.000000   82.000000
std    13.228757   23.065125
min    50.000000   56.000000
25%    60.000000   73.000000
50%    70.000000   90.000000
75%    72.500000   95.000000
max    75.000000  100.000000

In [50]:
dic1= {
    'col1' : ['1','2','3','4'],
    'col2' : [5,6,7,8]
}
n = pd.DataFrame(dic1)
n_df = n.astype({'col1' : int, 'col2' : float})
n_df.info()
print(n_df.dtypes)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 196.0 bytes
col1      int64
col2    float64
dtype: object

In [60]:
display(n_df['col1'])
display(n_df[['col1','col2']])

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

   col1  col2
0     1   5.0
1     2   6.0
2     3   7.0
3     4   8.0

In [68]:

for i, row in n_df.iterrows():
    print(i,row['col1'])
print(type(n_df.iterrows()))

0 1.0
1 2.0
2 3.0
3 4.0
<class 'generator'>

In [72]:
n_df["sum"] = n_df['col1'] + n_df['col2']
n_df

   col1  col2   sum
0     1   5.0   6.0
1     2   6.0   8.0
2     3   7.0  10.0
3     4   8.0  12.0

In [98]:
n1_df = n_df[ n_df['sum'] > 8 ]

In [99]:
n1_df

   col1  col2   sum
2     3   7.0  10.0
3     4   8.0  12.0

In [101]:
n2_df = n1_df.reset_index(drop=True)
print(n2_df)

   col1  col2   sum
0     3   7.0  10.0
1     4   8.0  12.0

In [4]:
import pandas as pd
titanic_df = pd.read_csv('data/titanic.csv')
# print(titanic_df)
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [15]:
titanic_df.describe()
print(titanic_df.head(10))

   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0         0       3    male  22.0      1      0   7.2500        S   Third
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
4         0       3    male  35.0      0      0   8.0500        S   Third
5         0       3    male   NaN      0      0   8.4583        Q   Third
6         0       1    male  54.0      0      0  51.8625        S   First
7         0       3    male   2.0      3      1  21.0750        S   Third
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
5    man        True  NaN   Queenstown    no   True
6    man        True    E  Southampton    no   True
7  child       False  NaN  Southampton    no  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False

In [11]:
titanic_df.sort_values(by = 'age', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [24]:
titanic_df.value_counts('who')

who
man      537
woman    271
child     83
Name: count, dtype: int64